IDENTIFICATION DIVISION.
PROGRAM-ID. FIZZBUZZ.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-COUNTER PIC 9(3) VALUE 0.
   01 WS-DIV-RESULT PIC 9(3) VALUE 0.

PROCEDURE DIVISION.
   A000-PARA.
      PERFORM B000-PARA VARYING WS-COUNTER FROM 1 BY 1 UNTIL WS-COUNTER = 101.
      STOP RUN.

   B000-PARA.
      COMPUTE WS-DIV-RESULT = FUNCTION MOD (WS-COUNTER , 15)
      IF WS-DIV-RESULT = 0
         DISPLAY "FIZZBUZZ"
      ELSE
         COMPUTE WS-DIV-RESULT = FUNCTION MOD (WS-COUNTER , 3)
         IF WS-DIV-RESULT = 0
            DISPLAY "FIZZ"
         ELSE
            COMPUTE WS-DIV-RESULT = FUNCTION MOD (WS-COUNTER , 5)
            IF WS-DIV-RESULT = 0
               DISPLAY "BUZZ"
            ELSE
               DISPLAY WS-COUNTER
      END-IF.
